#ifndef _TMCONN_H
#define _TMCONN_H

#ifdef IF_PORTCORE
#define TMCONN_NEW 1
#endif


#ifndef  TMCONN_NEW
typedef unsigned __int64 u64;
#define _STDCALL    __stdcall
#define _CDECL      __cdecl
#endif

#ifdef __cplusplus
extern "C" {
#endif

/*
#ifndef __TIME_H
#include <time.h>
#endif
*/

#define ERROR_TM_NOT_CONNECTED 0xc0001
#define TM_KERNEL_SIGNATURE 0x0830

#ifndef INVALID
#define INVALID 0xffffffff
#endif



#define SUCCESS 1                 // Успешное завершение функции
#define FAILURE 0                 // Ошибка при обработке запроса

/*------------- Определения флагов доступа -----------------*/

#define TMS_ACCESS_TM_READ			0x00000001
#define TMS_ACCESS_STATUS_CHANGE	0x00000002
#define TMS_ACCESS_ANALOG_CHANGE	0x00000004
#define TMS_ACCESS_ACCUM_CHANGE		0x00000008
#define TMS_ACCESS_TELECONTROL		0x00000010
#define TMS_ACCESS_RETRO_VIEW		0x00000020
#define TMS_ACCESS_LOG_VIEW			0x00000040
#define TMS_ACCESS_ALARM_CHANGE		0x00000080
#define TMS_ACCESS_TM_SOURCE		0x00000100
#define TMS_ACCESS_TMSRC_DIALOG		0x00000200
#define TMS_ACCESS_TOB_CHANGE		0x00000400
#define TMS_ACCESS_BACKUP			0x00000800
#define TMS_ACCESS_TM_SUBS			0x00001000

#define TMS_GENERIC_READ	TMS_ACCESS_TM_READ

#define TMS_GENERIC_WRITE	(TMS_ACCESS_TM_READ|TMS_ACCESS_STATUS_CHANGE|TMS_ACCESS_ANALOG_CHANGE|TMS_ACCESS_ACCUM_CHANGE| \
 TMS_ACCESS_RETRO_VIEW|TMS_ACCESS_LOG_VIEW|TMS_ACCESS_ALARM_CHANGE|TMS_ACCESS_TMSRC_DIALOG)

#define TMS_GENERIC_EXECUTE	TMS_GENERIC_READ


#define TMS_CAPS_LOGAUDIT			8
#define TMS_CAPS_RESVALEX			9
#define TMS_CAPS_MICROSERIES		10

#define TMS_CAPS_CFGT				120
#define TMS_CAPS_CNT				127

//////////////////////// TM-DATA TYPES
#define TM_STATUS			((WORD)0x8000)
#define TM_ANALOG			((WORD)0x8001)
#define TM_ACCUM			((WORD)0x8002)
#define TM_CONTROL			((WORD)0x8003)
#define TM_REGUL			((WORD)0x8004)
#define TM_STRING 			((WORD)0x8005)

#define TM_CHANNEL 			((WORD)0x9000)
#define TM_RTU 				((WORD)0x9001)

#define TM_RETRO_STATUS		((WORD)0x9010)
#define TM_RETRO_ANALOG		((WORD)0x9011)
#define TM_RETRO_ACCUM 		((WORD)0x9012)

#define TM_TAGGED_INFO		((WORD)0xff00)

#define TAGINF_SIMPLE		0


#define TMSV_PRFL_LINK				0x00000001
#define TMSV_PRFL_VSCRIPT			0x00000002

#define MAP_COMMAND_SUPPORTED		0
#define MAP_COMMAND_ACKNOWLEDGE		1
#define MAP_COMMAND_SET_BRIGHTNESS	2
#define MAP_COMMAND_ON_MODE			3
#define MAP_COMMAND_OFF_MODE		4
#define MAP_COMMAND_NORMAL_MODE		5
#define MAP_COMMAND_SET_BLINK_RATE	6
#define MAP_COMMAND_SHOW_UNDEFINED  7
#define MAP_COMMAND_DARK_MODE		8
#define MAP_COMMAND_STNORM_MODE		9
#define MAP_COMMAND_IND_ADDRESS		10




#define DNTT_DRIVER		'0'
#define DNTT_ADAPTER	'1'
#define DNTT_PORT		'2'
#define DNTT_RTU		'3'
#define DNTT_ARRAY		'4'
#define DNTT_BLOCK		'5'
#define DNTT_INFO		'6'
#define DNTT_FAILED		'9'

#define DNTERR_OK			0
#define DNTERR_THREAD		1
#define DNTERR_RESOURCE		2
#define DNTERR_MEMORY		3
#define DNTERR_UNKNOWN		100

////////////	Delta trace flags
#define DNT_TRACE_ERROR		0
#define DNT_TRACE_MSG		1
#define DNT_TRACE_DEBUG		2
#define DNT_TRACE_TM_IN		3
#define DNT_TRACE_TM_OUT	4
#define DNT_TRACE_S_IN		5
#define DNT_TRACE_S_OUT		6
#define DNT_TRACE_LOG		0x4000
#define DNT_TRACE_DRV		0x8000

////////////	TMS trace flags
#define TMS_TR_ERROR		0x0001
#define TMS_TR_MSG			0x0002
#define TMS_TR_DEBUG		0x0004
#define TMS_TR_TM_IN		0x0008
#define TMS_TR_TM_OUT		0x0010
////////////////////////////////

#define DNT_DRIVER_ETHERNET	1
#define DNT_DRIVER_COM		2

#ifndef TMS_BACKUP_
#define TMS_BACKUP_
#define TMS_BACKUP_CONFIG	1
#define TMS_BACKUP_ARRAY	2
#define TMS_BACKUP_EVLOG	4
#define TMS_BACKUP_ALARMS	8
#define TMS_BACKUP_RETRO	0x10
#define TMS_BACKUP_SECURITY	0x20
#endif

#define TMV_MAX_CLASSES		256

#ifndef RBS_BACKUP_
#define RBS_BACKUP_
#define RBS_BACKUP_BASES	1
#define RBS_BACKUP_SECURITY 2
#endif

#define DGM_DATASOURCE 			0x00000001
#define DGM_TRACEALL			0x00000002
#define DGM_TRACEDEF			0x00000004
#define DGM_TMNOTIFY			0x00000008
#define DGM_RETRANS				0x00000010
#define DGM_RETRANS_CHANGES		0x00000020
#define	DGM_RETRANS_STRBIN		0x00000040
#define	DGM_RETRANS_NOSTREAM	0x00000080
#define	EXTS_SHOW_S2			0x00000100
#define	DGM_TOB_CHANGE			0x00000200
#define	DGM_CALC				0x00000400
#define	DGM_TOB_RETRANS			0x00000800
#define DGM_DELTA				0x00001000
#define DGM_NEW_CLIENT			0x00002000

#define USER_DGM_FLAGS			(EXTS_SHOW_S2|DGM_TOB_CHANGE|DGM_NEW_CLIENT)


/*-------------------------------- * ------------------------------*/
#pragma pack(1)
typedef struct
	{
    short Ch;
    short RTU;
    short Point;
    } TADRtm;

typedef struct
	{
	WORD Type;
    WORD Ch;
    WORD RTU;
    WORD Point;
} TTMVAddr;

typedef struct
	{
	short Status;            // состояние объекта
	short Flags;             // флаги
	} TStatusPoint;			// Объект ТС

typedef struct
	{
	float asFloat;           // реальное значение ТИТ
	short asCode;            // код ТИТ, поступивший с ТМ
	short Flags;             // флаги
	CHAR  Unit[8];           // единицы измерения
	} TAnalogPoint;  // Объект ТИТ

typedef struct {
	float Value;
	short Flags;
}TAnalogPointShort;

typedef struct {
	DWORD fix_time;
	DWORD tm_time;
	WORD  chn;
	WORD  rtu;
	WORD  point;
	WORD  asCode;
	float asFloat;
	WORD  flags;
}TAnalogQueueRecord;

typedef struct {
	WORD	tm_type;
	WORD	Ch;
	WORD	RTU;
	WORD	Point;
	DWORD	unblk_ut;
}TPointEvBlock;

typedef struct {
	WORD level;
	WORD a[4];
	LPSTR name;
}TBaseObjectInfo;

typedef struct {
	TADRtm	a;
	BYTE type;
//	possible bits

#define VF_TYPE_STATUS				0x10
#define VF_TYPE_ANALOG_CODE			0x20
#define VF_TYPE_ANALOG_FLOAT		0x30
#define VF_TYPE_ACCUM_VALUE			0x40
#define VF_TYPE_ACCUM_CODE			0x50
#define VF_TYPE_ACCUM_INCREMENT		0x60
#define VF_TYPE_TELECTRL			0x70
#define VF_TYPE_ACCUM_FLOAT			0x80
#define VF_TYPE_ACCUM_DIRECT		0x90
#define VF_TYPE_ACCUM_FLT_DIRECT	0xa0
#define VF_TYPE_TC_ACK				0xb0
#define VF_TYPE_ANALOG_FLOATCODE	0xc0
#define VF_TYPE_REGULATION			0xd0

#define VF_FLG_IGNORE			0x00
#define VF_FLG_SET				0x01
#define VF_FLG_CLEAR			0x02
#define VF_FLG_COPY				0x03

#define VF_SIGNED				0x04
#define VF_ALWAYS_SET_VALUE		0x08

	BYTE					flags;
	BYTE					bits;

	union {
		BYTE				uchar;
		CHAR				schar;
		WORD				ushort;
		SHORT				sshort;
		DWORD           	ulong;
		INT	                slong;
		float				flt;
	};
}TValueAndFlags;

typedef struct {
	TValueAndFlags	vf;
	 WORD			s2;
} TVF_S2;

typedef struct {
	DWORD	sec;
	WORD	ms;
	WORD	flags;
#define TMXT_FLAG_GREENWICH		0x0001
#define TMXT_FLAG_CURDATA		0x0002
#define TMXT_FLAG_IV			0x0004
#define TMXT_FLAG_ZIMP			0x0008
#define TMXT_FLAG_USER			0x0010
#define TMXT_FLAG_MANRTR		0x0020
#define TMXT_FLAG_OFFSET		0x0040
#define TMXT_FLAG_NOSCRIPT		0x0080
#define TMXT_FLAG_TF_RES1		0x0100
#define TMXT_FLAG_TF_IV			0x0200


}TMXTime;

typedef struct {
	TValueAndFlags	vf;
	TMXTime			xt;
}TTimedValueAndFlags;

#define _TMSVX_TIMED	1
#define _TMSVX_S2		2
#define _TMSVX_ID		4
#define _TMSVX_EXF		8

typedef struct {
	WORD			Ch;
	WORD			RTU;
	WORD			Point;		//6
	DWORD			Value;		//10
	DWORD			sec;			//14
	BYTE			hund;		//15
    BYTE			DataType;	//16
}TTimedAccum;
typedef struct {
	WORD			Ch;
	WORD			RTU;
	WORD			Point;		//6
	DWORD			sec;			//10
	BYTE			hund;		//11
	BYTE			flags_type;	//12
    WORD			DataType;	//14
	BYTE			Data[16];	//30
}TTimedAccumEx;
typedef struct {
	WORD			Ch;
	WORD			RTU;
	WORD			Point;		//6
	DWORD			sec;		//10
	BYTE			hund;		//11
	BYTE			flags_type;	//12
    WORD			DataType;	//14
#define ACCFLG_INC		1
#define ACCFLG_DIRECT	2
	WORD			AccFlags;	//16
	BYTE			Data[16];	//32
}TAccumData;

typedef struct
    {
    WORD			Point;
    BYTE			RTU;
    BYTE			Ch;
	BYTE			GroupId;
	BYTE			AlarmId;
	float 			Value;
	WORD			Sign		:1;
	WORD			Sensibility	:7;
	WORD			Active		:2;
	WORD			InUse		:1;
	WORD			Zonal		:1;
	WORD			Importance	:4;
	WORD			Period;
	BYTE			DayMap[6];
	BYTE			WeekMap;
	BYTE			YearMap[6];
	BYTE			InDirect;
	WORD			CountDown;
	double 			Sum;
    } TAlarm;
#define ALARM_FILTER_DEFAULT	0
#define ALARM_FILTER_IIR_1		1
typedef struct
    {
    WORD			Point;
    BYTE			RTU;
    BYTE			Ch;
	BYTE			GroupId;
	BYTE			AlarmId;
	float 			Value;
	WORD			Sign		:1;
	WORD			Seconds		:3;
	WORD			FiltType	:4;
	WORD			Active		:2;	//modified by server
	WORD			InUse		:1;
	WORD			Zonal		:1;
	WORD			Importance	:4;
	WORD			Period;
	BYTE			DayMap[6];
	BYTE			WeekMap;
	BYTE			YearMap[6];
	BYTE			InDirect;
	WORD			CountDown;	//modified by server
	double 			Sum;		//modified by server

	BYTE			cRes[16];
	float			Param[2];
	DWORD	        lRes[6];

    } TAlarmNew;

typedef struct {
	float			Param;
	CHAR			ParamName[128];
	} TAlarmParam;

typedef struct {
	unsigned		short	bit_fields;
	float					cur_val;
	float					comp_val;

	} TAlarmState;

typedef struct
	{
	float Value;             // значение счетчика
	float Load;              // нагрузка
	short Flags;             // фла
	CHAR Unit[8];            // единицы измерения
	} TAccumPoint;   // Объект ТИИ


typedef struct {
	DWORD	sec;
	BYTE	hund;
	BYTE	ms;
}TTmsTime;

#define TMCPF_NAME		0x01
#define TMCPF_ALLFLAGS	0x02
#define TMCPF_ST0		0x04	
#define TMCPF_ST1		0x08	
#define TMCPF_SKIPRES	0x10
#define TMCPF_NOTIMOVRR	0x40


typedef struct {
	LPSTR	name;
	BYTE	cp_flags;
	BYTE	res1;

	WORD	Type;
	WORD	Ch;
	WORD	RTU;
	WORD	Point;
	DWORD	TM_Flags;

	WORD	tm_s2;
	WORD	tm_flags2;

	DWORD	tm_change_ut;
	DWORD	tm_tm_ut;
	WORD	tm_change_ms;
	WORD	tm_tm_ms;
	union {
		TStatusPoint st;
		TAnalogPoint an;
		TAccumPoint	 ac;
		BYTE		 padding[32];
	};
}TCommonPoint;


//	WORD	length;
//	WORD	signature;
//	BYTE	flags;
//	BYTE	importance;
//	WORD	type;

typedef struct {
	DWORD	name_off;
	BYTE	cp_flags;
	BYTE	res1;

	WORD	Type;
	WORD	Ch;
	WORD	RTU;
	WORD	Point;
	DWORD	TM_Flags;

	WORD	tm_s2;
	WORD	tm_flags2;

	DWORD	tm_change_ut;
	DWORD	tm_tm_ut;
	WORD	tm_change_ms;
	WORD	tm_tm_ms;
	union {
		TStatusPoint st;
		TAnalogPoint an;
		TAccumPoint	 ac;
		BYTE		 padding[32];
	};
}TCommonPoint32;

typedef	struct
{
	WORD	tm_type;
	DWORD	tms_flags;
	DWORD	tms_flags2;
}TFeedbackPropsSt;

typedef	struct
{
	WORD	tm_type;
	DWORD	tms_flags;
	DWORD	tms_flags2;
}TFeedbackPropsAn;

typedef	struct
{
	WORD	tm_type;
	DWORD	tms_flags;
	DWORD	tms_flags2;
}TFeedbackPropsAc;

#define TM_FBP_MAX_SIZE max(sizeof(TFeedbackPropsSt),max(sizeof(TFeedbackPropsAn),sizeof(TFeedbackPropsAc)))
#ifndef EXF_Present

#define EXF_NotTopical		0x00000001
#define EXF_Invalid			0x00000002
#define EXF_Overflow		0x00000004
#define EXF_OutofRange		0x00000008
#define EXF_BadReference	0x00000010
#define EXF_Oscillatory		0x00000020
#define EXF_Failure			0x00000040
#define EXF_OldData			0x00000080
#define EXF_Inconsistent	0x00000100
#define EXF_Inaccurate		0x00000200
#define EXF_Substituted		0x00000400
#define EXF_Test			0x00000800
#define EXF_OperatorBlocked	0x00001000

#define EXF_Present			0x80000000

#endif


typedef struct {
	float	val;
	DWORD	ut;
#define AMS_F_PRESENT	1
#define AMS_F_RELIABLE	2
	BYTE	sflg;
}TMSAnalogMSeriesElement;

typedef struct {
	WORD	interval;
	WORD	count;
	TMSAnalogMSeriesElement el[1];
}TMSAnalogMSeries;

typedef struct	{
	CHAR DateTime[24];       // время события в формате ДД.ММ.ГГГГ ЧЧ:ММ:СС.cc

	WORD			Imp;      // уровень важнос
	WORD			ID;       // тип события

	union {
		struct {
			WORD			Ch;       // кана
			WORD			RTU;      // номер КП  (c 1)
			WORD			Point;    // объект    (c 1)
		}Common;
		struct {
			WORD Kind;
			WORD DataLen;
			WORD Reserved;
		}Extended;
	};

	CHAR Data[22];
} TEvent;      // Событие


typedef struct
	{
	DWORD			Time;     // время в сек. с 01.01.1970
	BYTE			Hund;     // сотые доли сек.

	BYTE			Imp;      // уровень важнос
	WORD			ID;       // тип события
	union {
		struct {
			BYTE			Ch;       // кана
			BYTE			RTU;      // номер КП  (c 1)
			WORD			Point;    // объект    (c 1)
		}Common;
		struct {
			WORD			Kind;
			WORD			DataLen;
		}Extended;
	};
#define TTMSEVENT_HEADER_SIZE	12
	union
		{
		char EndOfHeader;
		BYTE end_header;
		struct
			{
			BYTE State;     // новое состояние ТС
			BYTE Class;     // класс телесигнала (К.А. - 0  АПС - 1)
#ifdef		TMCONN_NEW
			DWORD		ExtSig;									//6
			BYTE		ResCh;									//7
			BYTE		ResRTU;									//8
			WORD		ResPoint;								//10
			DWORD		FixUT;									//14
			WORD		S2;										//16
			DWORD		Flags;									//20
			WORD		FixMS;									//22  -- no more fields!
#endif
			} Status;  // параметры переключения ТС
		struct
			{
			float Val;      // значение контролируемого ТИТ
			WORD AlarmID;  // идентификатор уставк
			CHAR  State;    // 0 - уставка снята, 1 - уставка взведена
			} Alarm;   // параметры сработавшей уставк
		struct
			{
			BYTE  Ch;
			BYTE  RTU;
			WORD Point;
			BYTE  Cmd;     // выданная команда
			BYTE  Result;  // == SUCCESS если ТУ успешно, иначе FAILURE
			CHAR  UserName[16];  // пользователь, выдавший ТУ
			} Control; // параметры выданного телеуправления
		struct
			{
			union	{
				float F_val;
				SHORT S_val;
			};
			BYTE  Cmd;     // выданная команда
			BYTE  Result;  // == SUCCESS если ТУ успешно, иначе FAILURE
			CHAR  UserName[16];  // пользователь, выдавший ТУ
			} Regulation; // параметры выданного телерегулирования

		struct {
			float		Value;
			BYTE		State;
			CHAR		UserName[16];
		} AnalogSet;

		struct {
			BYTE data[1];
		} Extended;

		struct
			{
			DWORD index;
		} ExtendedLink;

		struct {
			FILETIME ft;
			WORD SavedID;
		} ExtFileLnk;

		struct {
			WORD		tmType;
			WORD		reserved1;
			WORD		reserved2;
			CHAR		UserName[16];  										// 22
		} Acknowledge;

		struct {
			WORD		tmType;
			DWORD		oldFlags;
			DWORD		newFlags;
		} FlagsChange;

	} Data;

} TTMSEvent;        // Событие в обмене

typedef struct {
			WORD		tmType;
			DWORD		oldFlags;
			DWORD		newFlags;
			union		{
				struct {
					BYTE Status;
					BYTE S2;
				}st;
				struct {
					WORD	asCode;
					float	asFloat;
				}an;
			};
			BYTE	reserved[4];
			CHAR	UserName[16];
}TTMSFlagsChangeData;

typedef struct
	{
	BYTE		State;     	
	BYTE		Class;     	
	DWORD		ExtSig;	
	BYTE		ResCh;	
	BYTE		ResRTU;
	WORD		ResPoint;
	DWORD		FixUT;
	WORD		S2;
	DWORD		Flags;
	WORD		FixMS;
	DWORD		oldFlags;
	CHAR		UserName[16];
}TTMSStatusChangeData;

typedef struct _TEventEx{
#ifdef IF_PORTCORE
    PVOID   next;
#else
	struct _TEventEx* next;
#endif
	DWORD size;
	TEvent evt;
}TEventEx;

typedef struct {
	u64 r;
	u64 m;
}TTMSElix;

typedef struct {
	TTMSElix elix;
	TTMSEvent ev;
}TTMSEventElix;

typedef struct {
	TTMSElix	elix;
	DWORD		ack_sec;
	WORD		ack_ms;
	CHAR		uname[16];
}TTMSEventAddData_v1;

typedef struct _TEventElix{
	struct _TEventElix* next;
	TTMSElix			elix;
	DWORD				ev_size;	//sizeof(ptr)+sizeof(TTMSElix)
	TEvent				evt;		//sizeof(ptr)+sizeof(TTMSElix)+sizeof(DWORD)
}TEventElix;

typedef struct {
	DWORD	ItemsLimit;
	DWORD	MemoryLimit;
	HANDLE	hStop;
	BOOL	Interrupted;
	BOOL	EvlArch;
}TEventExCriteria;

typedef	struct	{
	TTmsTime		time_act;
	TTmsTime		time_deact;
	TTMSEvent		ev;
}TAlertData;		//46

typedef struct {
	union {
		DWORD		uval;
		float		fval;
	}				cur_val;
	WORD			cur_s2;
	DWORD			cur_flags;
	DWORD			reserved;
	TAlertData		alert;
}TAlertListElement;

typedef struct {
	BYTE			idata[16];
}TAlertListId;

typedef struct {
	WORD Source;
	BYTE Rtu;
	BYTE Chn;
	BYTE Str_And_Bin;
}EXTEVL_STRBIN;

typedef struct {
	WORD Source;	//==0
	WORD Reserved;	//==0
	CHAR Str[1];
}EXTEVL_MODEL;

typedef struct {
	CHAR	sig[2];	//'T','D'
	DWORD	id;
	DWORD	delta_addr[16];
	DWORD	value_idx;
	CHAR	name[296];
	CHAR	value[128];
}TAGGED_DATA_DG;

struct StatusData  // параметры переключения ТС
	{
	BYTE	State;    // новое состояние ТС
	BYTE	Class;    // класс телесигнала (К.А. - 0  АПС - 1)
	DWORD		ExtSig;									//6
	BYTE		ResCh;									//7
	BYTE		ResRTU;									//8
	WORD		ResPoint;								//10
	DWORD		FixUT;									//14
	WORD		S2;										//16
	DWORD		Flags;									//20
	WORD		FixMS;									//22  -- no more fields!
	};
struct AlarmData   // параметры сработавшей уставки
	{
	float	Val;     // значение контролируемого ТИТ
	WORD	AlarmID; // идентификатор уставк
	BYTE	State;   // 0 - уставка снята, 1 - уставка взведена
	};
struct ControlData // параметры выданного телеуправления
	{
	BYTE	Ch;
	BYTE	RTU;
	WORD	Point;
	BYTE	Cmd;     // выданная команда
	BYTE	Result;  // == SUCCESS если ТУ успешно, иначе FAILURE
	CHAR	UserName[16];  // пользователь, выдавший ТУ
	};

////////////////////////	AAN

//	DON'T EVER CHANGE THE STRUCTURES!

typedef struct{
	WORD	ms;
	float	value;
	DWORD	flags;
}TMAAN_SR_DATA;

#define AANSR_LAST	0xffff

typedef struct {
	BYTE			legend;
	BYTE			mdflg;	//l=2
	float			v_min;	//l=6
	float			v_max;	//l=10
	float			v_last;	//l=14
	WORD			v_avg;	//l=16
	DWORD			v_tmflg;//l=20
	DWORD			series;	//l=24
}TMAAN_MIN_DATA;

#define AAMDF_OVF			1

#define AAMDL_NO_DATA		0
#define AAMDL_NOT_WR		0xff
#define AAMDL_OK			1
